exp_roomWT/nv_windAroundBuildings2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    wtwalls
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.5;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.5;
        value           uniform 1.5;
    }
}


// ************************************************************************* //
